### micro-Services-Tutorial
 微服务最早由Martin Fowler与James Lewis于2014年共同提出，微服务架构风格是一种使用一套小服务来开发单个应用的方式途径，每个服务运行在自己的进程中，并使用轻量级机制通信，通常是HTTP API，这些服务基于业务能力构建，并能够通过自动化部署机制来独立部署，这些服务使用不同的编程语言实现，以及不同数据存储技术，并保持最低限度的集中式管理。然而微服务又需要限流器(Rate Limiter)，数据传输(Trasport 序列化和反序列化),日志(Logging),指标(Metrics)
,断路器(Circuit breaker),请求追踪(Request tracing ),服务发现(Service Discovery),因此就想写一篇关于微服务和微服务组件的总结来记录下自己使用优化的过程．

#### Redis命令解析

Redis是一个高性能的内存数据库，它体积轻巧性能又高，在企业中被广泛使用。

Redis是一个一个高性能的key-value存储系统。Redis和Memcached(分布式的高速缓存系统)有点类似，它支持存储的键值类型包括string(字符串)、list(链表)、set(集合)、sorted set(有序集合)和hash(哈希类型)。这些数据类型都支持push、pop、add、remove,计算集合的交集、并集与差集等。更丰富的操作，而且这些操作都是原子性的。在此基础上，redis支持各种不同方式的排序。与Memcached一样，为了保证效率，数据都是缓存在内存中。区别的是redis会周期性的把更新的数据写入磁盘或者把修改操作写入追加的记录文件，并且在此基础上实现了master-slave(主从)同步。

#### 安装Redis
这里我在服务器上的centos7.3系统下安装，由于Redis目前没有官方RPM安装包，因此我们需要从源代码编译，而为了要编译就需要安装 Make和Gcc。

```bash
> yum install gcc make
```
然后下载Redis源码,解压，编译:
```bash
> wget http://download.redis.io/releases/redis-4.0.10.tar.gz
```
解压缩:
```bash
> tar xzf redis-4.0.10.tar.gz
```
进入解压后的目录:
```bash
> cd redis-4.0.10
```
使用Make 编译源文件:
```bash
> make
```
进入源文件的目录:
```bash
> cd src
```
复制 Redis 的服务器和客户端到 /usr/local/bin:
```bash
> cp redis-server redis-cli /usr/local/bin
```
在把sentinel，benchmark 和 check 复制过去:
```bash
> cp redis-sentinel redis-benchmark redis-check-aof redis-check-dump /usr/local/bin
```
创建redis 配置文件夹：
```bash
> mkdir /etc/redis
```
在/var/lib/redis 下创建有效的保存数据的目录：
```bash
> mkdir -p /var/lib/redis/6379
```

#### 配置参数
redis.conf 这个文件是 redis的配置文件，但是你会看到这个文件的名字是 6379.conf ，而这个数字就是 redis 监听的网络端口。如果你想要运行超过一个的 redis 实例，推荐用这样的名字。

复制第一步解压目录下的 redis.conf 到 /etc/redis/6379.conf，现在编辑这个文件并且配置参数。
```bash
> cp redis.conf  /etc/redis/6379.conf
> vim /etc/redis/6379.conf
```
* 在6379.conf文件中配置如下:

设置 daemonize(Linux守护进程运行命令daemonize)为在前台运行还是后台运行，如果Redis会突然挂掉，就需要它运行在前台， 则设置 daemonize 为 no；如需要它在后台运行，设置为yes。

这里我设置的daemonize在后台运行：
```bash
daemonize yes
```
由于linux中一些deamon程序，由于一般只运行一个，因此就只有一个唯一的pid，因此为了其他程序方便知道该deamon的pid，就自建了一个pid file，一般是/var/run/deamon_name.pid，比如syslogd就是/var/run/syslogd.pid. 这个文件的内容就是这个deamon的pid.

这里设置 pidfile 为 /var/run/redis_6379.pid:
```bash
pidfile /var/run/redis_6379.pid
```
但是如果不准备用默认端口，也可以修改:
```bash
port 6379
```

然后设置日志级别：
```bash
loglevel notice
```
设置目录为 /var/lib/redis/6379:
```bash
dir /var/lib/redis/6379
```

运行6379.conf文件:

```bash
> cd /etc/redis/
> redis-server 6379.conf
> redis-server /etc/redis/6379.conf
```

然后检查下我们配置的是不是生效了：
```bash
#检测后台进程是否存在
> ps -ef |grep redis

#检测6379端口是否在监听
> netstat -lntp | grep 6379

#使用redis-cli客户端检测连接是否正常，
> cd /usr/local/bin/
```

通过下面的命令启动Redis服务：
```bash
> redis-server
32902:C 16 Aug 06:21:18.161 # Warning: no config file specified, using the default config. In order to specify a config file use src/redis-server /path/to/redis.conf
32902:M 16 Aug 06:21:18.161 * Increased maximum number of open files to 10032 (it was originally set to 1024).
                _._                                                  
           _.-``__ ''-._                                             
      _.-``    `.  `_.  ''-._           Redis 4.0.10 (00000000/0) 64 bit
  .-`` .-```.  ```\/    _.,_ ''-._                                   
 (    '      ,       .-`  | `,    )     Running in standalone mode
 |`-._`-...-` __...-.``-._|'` _.-'|     Port: 6379
 |    `-._   `._    /     _.-'    |     PID: 32902
  `-._    `-._  `-./  _.-'    _.-'                                   
 |`-._`-._    `-.__.-'    _.-'_.-'|                                  
 |    `-._`-._        _.-'_.-'    |           http://redis.io        
  `-._    `-._`-.__.-'_.-'    _.-'                                   
 |`-._`-._    `-.__.-'    _.-'_.-'|                                  
 |    `-._`-._        _.-'_.-'    |                                  
  `-._    `-._`-.__.-'_.-'    _.-'                                   
      `-._    `-.__.-'    _.-'                                       
          `-._        _.-'                                           
              `-.__.-'                                               

32902:M 16 Aug 06:21:18.164 # WARNING: The TCP backlog setting of 511 cannot be enforced because /proc/sys/net/core/somaxconn is set to the lower value of 128.
32902:M 16 Aug 06:21:18.164 # Server started, Redis version 4.0.10
```

这样就安装成功了，你可以使用内置的客户端命令redis-cli进行使用：
```bash
> redis-cli
127.0.0.1:6379> redis *
(error) ERR unknown command 'redis'

127.0.0.1:6379> set key "hello Redis"
OK
127.0.0.1:6379> get key
"hello Redis"
127.0.0.1:6379> exit
```
这样就可以使用Redis了．

你也可以使用停止命令停止使用客户端:
```bash
> redis-cli shutdown
```
或者使用kill -9命令杀掉进程：
```bash
> ps aux|grep redis
root      42175  0.0  0.0 140892  7428 ?        Ssl  09:17   0:00 redis-server *:6379
root      42476  0.0  0.0 112704  1016 pts/1    R+   09:23   0:00 grep --color=auto redis
> kill -9 42175
> kill -9 42476
```
应用示例:
```go
package main

import (
	 "fmt"
	 "log"
	 "strconv"
 	"encoding/json"
  
 	"github.com/spf13/cast"
  "github.com/go-redis/redis"
)



func main(){
	client := redis.NewClient(&redis.Options{
		Addr: "localhost:6379",
		Password: "",      //默认空密码
		DB: 0,  	       //使用默认数据库
	})
	defer client.Close()       //最后关闭

	pong, err := client.Ping().Result()
	if err != nil {
		log.Fatal(err)
	}
	fmt.Println("Connected result: ", pong)

	//string
	client.Set("str1", "hello redis",0)

	//str := client.Get("str1")
	//fmt.Println(str)

	//hashes的操作
	var user map[string]interface{}
	user = make(map[string]interface{})
	user["name"] = "jame"
	user["gender"] = "man"
	user["age"] = 26
	client.HMSet("user",user)

	str1,_ := client.HGetAll("user").Result()
	str1["age"] = strconv.FormatInt(29,10)
	str1["age"] = cast.ToString(10)

	fmt.Println(str1)
	m := str1["age"]
	n ,_:= strconv.ParseInt(m,10,64)
	fmt.Println("n:",n)

	bin,_:= json.Marshal(str1)
	//m := string(bin)
	fmt.Println("bin:",string(bin))
	json.Unmarshal(bin,&user)
	fmt.Println("user:",user)

	//map to json
	p := map[string]interface{}{"int": 1, "string": "giraffe", "bool": true, "float": 4.0}
	data, err := json.Marshal(p)
	if err != nil {
		fmt.Printf("marshal failed: %s", err)
	}
	fmt.Printf("data:%s\n", data)

}

func map2json(str1 map[string]string, n interface{})(interface{},error){
	bin,err:= json.Marshal(str1)
	if err !=nil{
		fmt.Println("Marshal member",err.Error())
	}
	fmt.Println("bin",string(bin))
	m := string(bin)
	if err := json.Unmarshal([]byte(m),&n);err !=nil{
		log.Println("JSON unmarshaling failed: %v",err)
	}
	p,err := json.Marshal(n)
	return string(p) ,err
}
```
运行:
```go
Connected result:  PONG
map[age:10 name:jame gender:man]
n: 10
bin: {"age":"10","gender":"man","name":"jame"}
user: map[name:jame gender:man age:10]
data:{"bool":true,"float":4,"int":1,"string":"giraffe"}

```

  
