### micro-Services-Tutorial
 微服务最早由Martin Fowler与James Lewis于2014年共同提出，微服务架构风格是一种使用一套小服务来开发单个应用的方式途径，每个服务运行在自己的进程中，并使用轻量级机制通信，通常是HTTP API，这些服务基于业务能力构建，并能够通过自动化部署机制来独立部署，这些服务使用不同的编程语言实现，以及不同数据存储技术，并保持最低限度的集中式管理。然而微服务又需要限流器(Rate Limiter)，数据传输(Trasport 序列化和反序列化),日志(Logging),指标(Metrics)
,断路器(Circuit breaker),请求追踪(Request tracing ),服务发现(Service Discovery),因此就想写一篇关于微服务和微服务组件的总结来记录下自己使用优化的过程．

#### redis命令解析
Redis是一个高性能的内存数据库，它体积轻巧性能又高，在企业中被广泛使用。

Redis是一个一个高性能的key-value存储系统。Redis和Memcached(分布式的高速缓存系统)有点类似，它支持存储的键值类型包括string(字符串)、list(链表)、set(集合)、sorted set(有序集合)和hash(哈希类型)。这些数据类型都支持push、pop、add、remove,计算集合的交集、并集与差集等。更丰富的操作，而且这些操作都是原子性的。在此基础上，redis支持各种不同方式的排序。与Memcached一样，为了保证效率，数据都是缓存在内存中。区别的是redis会周期性的把更新的数据写入磁盘或者把修改操作写入追加的记录文件，并且在此基础上实现了master-slave(主从)同步。

#### 安装Redis
这里我在服务器上的centos7.3系统下安装，由于Redis目前没有官方RPM安装包，因此我们需要从源代码编译，而为了要编译就需要安装 Make和Gcc。
```bash
> yum install gcc make
```
然后下载Redis源码,解压，编译:
```bash
> wget http://download.redis.io/releases/redis-4.0.10.tar.gz
> tar xzf redis-4.0.10.tar.gz
> cd redis-4.0.10
> make
```
二进制文件是编译完成后在src目录下，通过下面的命令启动Redis服务：
```bash
> src/redis-server
32902:C 16 Aug 06:21:18.161 # Warning: no config file specified, using the default config. In order to specify a config file use src/redis-server /path/to/redis.conf
32902:M 16 Aug 06:21:18.161 * Increased maximum number of open files to 10032 (it was originally set to 1024).
                _._                                                  
           _.-``__ ''-._                                             
      _.-``    `.  `_.  ''-._           Redis 4.0.10 (00000000/0) 64 bit
  .-`` .-```.  ```\/    _.,_ ''-._                                   
 (    '      ,       .-`  | `,    )     Running in standalone mode
 |`-._`-...-` __...-.``-._|'` _.-'|     Port: 6379
 |    `-._   `._    /     _.-'    |     PID: 32902
  `-._    `-._  `-./  _.-'    _.-'                                   
 |`-._`-._    `-.__.-'    _.-'_.-'|                                  
 |    `-._`-._        _.-'_.-'    |           http://redis.io        
  `-._    `-._`-.__.-'_.-'    _.-'                                   
 |`-._`-._    `-.__.-'    _.-'_.-'|                                  
 |    `-._`-._        _.-'_.-'    |                                  
  `-._    `-._`-.__.-'_.-'    _.-'                                   
      `-._    `-.__.-'    _.-'                                       
          `-._        _.-'                                           
              `-.__.-'                                               

32902:M 16 Aug 06:21:18.164 # WARNING: The TCP backlog setting of 511 cannot be enforced because /proc/sys/net/core/somaxconn is set to the lower value of 128.
32902:M 16 Aug 06:21:18.164 # Server started, Redis version 4.0.10
```

这样就安装成功了，你可以使用内置的客户端命令redis-cli进行使用：
```bash
> src/redis-cli
redis> set foo bar
OK
redis> get foo
"bar"
```
这样就可以使用Redis了．


  
